'''"Arg-parser": Створити python-програму, звпустивши яку з аргументом -h або --help в консоль буде виведено текст:
 "Тут могла бути ваша... допомога =)", а якщо передати аргумент -n або --name та ввести ім'я , то в консоль буде надруковано:
"Валєнтін, японскій бог, ти зачєм у ката яйца-та аткрутіл?!",
 а якщо буде введено інше ім'я, то в консоль надрукується "Welcome," та це ім'я.'''
import argparse

parser = argparse.ArgumentParser(description='Тут могла бути ваша... допомога =)')
parser.add_argument('--name','-n', type=str, help="Напиши своє ім'я")
args = parser.parse_args()

if "Валєнтін" in args.name:
    print("Валєнтін, японскій бог, ти зачєм у ката яйца-та аткрутіл?!")
else:
    print(f'Welcome, {args.name}')

