'''Створти 3 python пакети, в яких розмістити тести в такому вигляді:

В першому пакунку створтити файл з 5 тестами, що знаходяться у класі. Перед та після тестів
повинна відпрацювати фікстура, що виведе в консоль повідомлення про початок та кінець свого виконання.
 Нехай тести також виведуть в консоль що небудь. На усі тести поставити мітку "from_class".

В другому пакунку створити файл з 3 параметризованими тестами, один з яких буде ітеруватись і
перевіряти одиничні значення, другий перевірятиме пари значень, третій перевірятиме будь-які
значення на ваш розсуд, але кожному значенню має бути присвоєний псевдонім. На кожен з тестів має
бути застосована одна глобальна фікстура. На усіх тестах має бути мітка "param"

В третьому пакунку створити довільну кількість тестів (але не менше 3-х), організованих довільно,
але на конжному має бути 2 мітки: одна спільна для усіх тестів в цьому пакунку ("pack"), інша --
 спільна для як мінімум 2-х тестів ("joint"), і ще інша для остачі тестів ("rest"). На кожен тест в пакунку має бути застосована фікстура.
Для кожного пакунку мають бути свої фікстури.

Запустити тести так, щоб виконались усі тести з мітками "from_class" та "pack"
 pytest -m "from_class or  pack"

Запустити тести так, щоб виконались усі тести з усіма мітками крім "from_class"
 pytest -m "not from_class"

Запустити тести так, щоб виконались усі тести з мітками "pack" але виключити тести з міткою "rest
pytest -m "pack and not rest"
"'''

